// 流程控制
// 1.顺序结构--代码从上而下的执行
// 2.分支结构--1.单个条件判断
// if语句
// if (条件语句){代码块}
// 课堂练习: 根据输入年龄打印如下内容：超过16岁，打印年龄：XX岁，可以当兵。
// var age = 19;
// if (age >= 18) {
//   console.log("可以当兵")
// } else {
//   console.log('年龄太小，不符合条件')
// }
            //2.二选一条件判断
// if（条件1）{执行1}else{执行2}
//  课堂作业: 根据输入的数字，判断如果是1-5打印工作日，如果是6，7打印休息日。
// 对一个学生的考试成绩进行等级的划分，
// 如果分数大于等于80分，小于等于100分等级为优；
// 如果分数大于等于70分，小于80分级为良；
// 如果分数大于等于60分，小于70分等级为及格；
// 60以下为不及格；
// 大于100或者小于0则分数异常。
            //3.多个条件判断
// if（条件1）{执行1}else if（条件2）{执行2}else{执行3}
            //4.多层条件判断
// if（条件1）{if（条件2）{执行1}}
// 课堂练习: 
  // 根据这个人的体重判断，
  // 体重在100~200为健康，否则为不健康，
  // (健康分为：偏瘦100-小于120 /正常 大于等于120-160/偏胖180-200)。

  // >=100 < 120 偏瘦
  // >=120 < 160 正常
  // >=160 < 180 微胖
  // >=180 <= 200 偏胖
// 4.swich选择语句
// swich(表达式){case 值1：执行语句1；break；case 值1：执行语句1；break；case 值1：执行语句1；break；..defloat:执行语句；break；}
// 根据 用户输入1-7 打印对应的星期几
// 3.循环结构
// 课堂练习: 请大家输出 1-100之间的所有数
// 尝试 输出1-100之间的偶数
// for语句
// for (初始化表达式1；布尔表达式；步进表达式){循环体}















// 流程控制
// 1.顺序结构--代码从上而下的执行
// 2.分支结构--1.单个条件判断
// if语句
// if (条件语句){代码块}
// 课堂练习: 根据输入年龄打印如下内容：超过16岁，打印年龄：XX岁，可以当兵。
            //2.二选一条件判断
// if（条件1）{执行1}else{执行2}
//  课堂作业: 根据输入的数字，判断如果是1-5打印工作日，如果是6，7打印休息日。
// 对一个学生的考试成绩进行等级的划分，
// 如果分数大于等于80分，小于等于100分等级为优；
// 如果分数大于等于70分，小于80分级为良；
// 如果分数大于等于60分，小于70分等级为及格；
// 60以下为不及格；
// 大于100或者小于0则分数异常。
            //3.多个条件判断
// if（条件1）{执行1}else if（条件2）{执行2}else{执行3}
            //4.多层条件判断
// if（条件1）{if（条件2）{执行1}}
// 课堂练习: 
  // 根据这个人的体重判断，
  // 体重在100~200为健康，否则为不健康，
  // (健康分为：偏瘦100-小于120 /正常 大于等于120-160/偏胖180-200)。

  // >=100 < 120 偏瘦
  // >=120 < 160 正常
  // >=160 < 180 微胖
  // >=180 <= 200 偏胖
// 4.swich选择语句
// swich(表达式){case 值1：执行语句1；break；case 值1：执行语句1；break；case 值1：执行语句1；break；..defloat:执行语句；break；}
// 根据 用户输入1-7 打印对应的星期几
// 3.循环结构
// 课堂练习: 请大家输出 1-100之间的所有数
// 尝试 输出1-100之间的偶数
// for语句
// for (初始化表达式1；布尔表达式；步进表达式){循环体}






















// 流程控制
// 1.顺序结构--代码从上而下的执行
// 2.分支结构--1.单个条件判断
// if语句
// if (条件语句){代码块}
// 课堂练习: 根据输入年龄打印如下内容：超过16岁，打印年龄：XX岁，可以当兵。
            //2.二选一条件判断
// if（条件1）{执行1}else{执行2}
//  课堂作业: 根据输入的数字，判断如果是1-5打印工作日，如果是6，7打印休息日。
// 对一个学生的考试成绩进行等级的划分，
// 如果分数大于等于80分，小于等于100分等级为优；
// 如果分数大于等于70分，小于80分级为良；
// 如果分数大于等于60分，小于70分等级为及格；
// 60以下为不及格；
// 大于100或者小于0则分数异常。
            //3.多个条件判断
// if（条件1）{执行1}else if（条件2）{执行2}else{执行3}
            //4.多层条件判断
// if（条件1）{if（条件2）{执行1}}
// 课堂练习: 
  // 根据这个人的体重判断，
  // 体重在100~200为健康，否则为不健康，
  // (健康分为：偏瘦100-小于120 /正常 大于等于120-160/偏胖180-200)。

  // >=100 < 120 偏瘦
  // >=120 < 160 正常
  // >=160 < 180 微胖
  // >=180 <= 200 偏胖
// 4.swich选择语句
// swich(表达式){case 值1：执行语句1；break；case 值1：执行语句1；break；case 值1：执行语句1；break；..defloat:执行语句；break；}
// 根据 用户输入1-7 打印对应的星期几
// 3.循环结构
// 课堂练习: 请大家输出 1-100之间的所有数
// 尝试 输出1-100之间的偶数
// for语句
// for (初始化表达式1；布尔表达式；步进表达式){循环体}